app/controllers/casts_controller.rb

	def new
		#@customer = Customer.find(@current_user.id)
		if request.post?
			@issue_no = params[:issue_no] if request.post?
			@customer = Customer.find_by_issue_no(@issue_no)
---
SELECT * FROM `customers` WHERE (`customers`.`issue_no` = '1234') LIMIT 1

	def create
		@customer = Customer.find_by_id(params[:customer_id])
		@customer.casts << Cast.new(params[:cast])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = '{:value=>1}') LIMIT 1
INSERT INTO `casts` (`money`, `remark`, `casttime_on`, `location_id`, `customer_id`) VALUES(1234.0, 'asdfa', '2011-03-04 18:31:03', NULL, 1)