app/controllers/customers_controller.rb

SELECT * FROM `customers`
---
  def index
    @customers = Customer.all

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO `customers` (`last_name`, `first_name`, `money`, `cast_count`, `delta_count`, `created_at`, `updated_at`, `issue_no`) VALUES('胡', '余义', NULL, NULL, NULL, '2011-03-04 06:38:30', '2011-03-04 06:38:30', 1234)
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save