app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `login`, `crypted_password`, `password_salt`, `persistence_token`, `login_count`, `last_request_at`, `last_login_at`, `current_login_at`, `last_login_ip`, `current_login_ip`) VALUES('2011-03-04 04:15:29', '2011-03-04 04:15:29', 'hysios', 'd0eeb7f4ffe837686262b9ff8d16a84068e74bd9569cbdb79c978616efbdccbc86aabc6f223b5c90ead50924078381eba5ff96acf09b3d23bbc9afe60ea6aa1c', 'KtCeNS3ePi1lGBJFCqNe', '54578fa99e7f7e492cf316d7292b16831d97126328edf2459e5da9490d5c69bf8bf07a2abb51fa9291332f094811359ba8c03c881554732beb9e3ebf4e775eb4', 1, '2011-03-04 04:15:29', NULL, '2011-03-04 04:15:29', NULL, '127.0.0.1')